#### Terraform Format and Style ``
#### Terraform Initialization ``
#### Terraform Validation ``
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.demo_apps_lb will be created
  + resource "aws_lb" "demo_apps_lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "demo-apps-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "dev"
          + "Name"        = "healthcare-app-dev-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "healthcare-app-dev-alb"
          + "Project"     = "ecs-fargate"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.http_listener will be created
  + resource "aws_lb_listener" "http_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment" = "dev"
          + "Name"        = "healthcare-app-dev-alb-listener"
        }
      + tags_all                                                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "healthcare-app-dev-alb-listener"
          + "Project"     = "ecs-fargate"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Healthcare Application - Try /patients or /appointments"
              + status_code  = "404"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener_rule.appointment_service_rule will be created
  + resource "aws_lb_listener_rule" "appointment_service_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags         = {
          + "Environment" = "dev"
          + "Name"        = "healthcare-app-dev-appointment-rule"
          + "Service"     = "appointment-service"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "healthcare-app-dev-appointment-rule"
          + "Project"     = "ecs-fargate"
          + "Service"     = "appointment-service"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/appointments*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.health_check will be created
  + resource "aws_lb_listener_rule" "health_check" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 50
      + tags         = {
          + "Environment" = "dev"
          + "Name"        = "healthcare-app-dev-health-rule"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "healthcare-app-dev-health-rule"
          + "Project"     = "ecs-fargate"
        }

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "application/json"
              + message_body = jsonencode(
                    {
                      + services = [
                          + "patient-service",
                          + "appointment-service",
                        ]
                      + status   = "healthy"
                    }
                )
              + status_code  = "200"
            }
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/health",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.patient_service_rule will be created
  + resource "aws_lb_listener_rule" "patient_service_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Environment" = "dev"
          + "Name"        = "healthcare-app-dev-alb-listener"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "healthcare-app-dev-alb-listener"
          + "Project"     = "ecs-fargate"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/patients*",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.appointment_tg will be created
  + resource "aws_lb_target_group" "appointment_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "appointment-service-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "healthcare-app-dev-appointment-tg"
          + "Service"     = "appointment-service"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "healthcare-app-dev-appointment-tg"
          + "Project"     = "ecs-fargate"
          + "Service"     = "appointment-service"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group.patient_tg will be created
  + resource "aws_lb_target_group" "patient_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "patient-service-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.appointment.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "demo-ecs-appointment"
    }

  # module.appointment.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo-ecs-appointment"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.cloudwatch.aws_cloudwatch_log_group.ecs_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "ecs-cluster-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.ecs_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/demo-ecs-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
    }

  # module.ecs.aws_ecs_cluster.demo will be created
  + resource "aws_ecs_cluster" "demo" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "demo-ecs-cluster"
      + tags_all = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_service.appointment_service will be created
  + resource "aws_ecs_service" "appointment_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "appointment-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "appointment-service"
          + container_port   = 3001
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.patient_service will be created
  + resource "aws_ecs_service" "patient_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "patient-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "patient-service"
          + container_port   = 3000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.appointment_service will be created
  + resource "aws_ecs_task_definition" "appointment_service" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + essential        = true
                  + image            = "211125325699.dkr.ecr.ap-south-1.amazonaws.com/demo-ecs-appointment:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "ecs-cluster-logs"
                          + awslogs-region        = "ap-south-1"
                          + awslogs-stream-prefix = "appointment-service"
                        }
                    }
                  + memory           = 512
                  + name             = "appointment-service"
                  + portMappings     = [
                      + {
                          + containerPort = 3001
                          + hostPort      = 3001
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "demo-task-appointment"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.patient_service will be created
  + resource "aws_ecs_task_definition" "patient_service" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + essential        = true
                  + image            = "211125325699.dkr.ecr.ap-south-1.amazonaws.com/demo-ecs-patitent:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "ecs-cluster-logs"
                          + awslogs-region        = "ap-south-1"
                          + awslogs-stream-prefix = "patient-service"
                        }
                    }
                  + memory           = 512
                  + name             = "patient-service"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "demo-task-patient"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + track_latest             = false
    }

  # module.iam.aws_iam_role.ecs_execution_role will be created
  + resource "aws_iam_role" "ecs_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-task-role"
    }

  # module.nat.aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "demo-ec-fargate-vpc-dev-nat-eip"
        }
      + tags_all             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-dev-nat-eip"
          + "Project"     = "ecs-fargate"
        }
      + vpc                  = (known after apply)
    }

  # module.nat.aws_nat_gateway.demo-natgw will be created
  + resource "aws_nat_gateway" "demo-natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "demo-ec-fargate-vpc-dev-nat-gw"
        }
      + tags_all                           = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-dev-nat-gw"
          + "Project"     = "ecs-fargate"
        }
    }

  # module.nat.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_internet_gateway.demo-igw will be created
  + resource "aws_internet_gateway" "demo-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "demo-ec-fargate-vpc-dev-igw"
        }
      + tags_all = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-dev-igw"
          + "Project"     = "ecs-fargate"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route_table.private-routing-table will be created
  + resource "aws_route_table" "private-routing-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "demo-ec-fargate-vpc-Private-RT"
          + "environment" = "dev"
        }
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-Private-RT"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public-routing-table will be created
  + resource "aws_route_table" "public-routing-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo-ec-fargate-vpc-Public-RT"
          + "environment" = "dev"
        }
      + tags_all         = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-Public-RT"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private-subnets[0] will be created
  + resource "aws_route_table_association" "private-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private-subnets[1] will be created
  + resource "aws_route_table_association" "private-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public-subnets[0] will be created
  + resource "aws_route_table_association" "public-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public-subnets[1] will be created
  + resource "aws_route_table_association" "public-subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for LoadBalancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "demo-ecs_fargate-default-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-ecs_fargate-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ecs_fargate-alb-sg"
          + "Project"     = "ecs-fargate"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group.demo_sg will be created
  + resource "aws_security_group" "demo_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for Task definition"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "demo-ecs_fargate-default-fargate-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-ecs_fargate-ecs_fargate-sg"
        }
      + tags_all               = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ecs_fargate-ecs_fargate-sg"
          + "Project"     = "ecs-fargate"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group_rule.ecs_egress_alb will be created
  + resource "aws_security_group_rule" "ecs_egress_alb" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.network.aws_security_group_rule.ecs_egress_demo will be created
  + resource "aws_security_group_rule" "ecs_egress_demo" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.network.aws_security_group_rule.ecs_ingress_alb will be created
  + resource "aws_security_group_rule" "ecs_ingress_alb" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allowing load balancer port"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.network.aws_security_group_rule.ecs_ingress_demo["app-port"] will be created
  + resource "aws_security_group_rule" "ecs_ingress_demo" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow traffic to app port"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # module.network.aws_security_group_rule.ecs_ingress_demo["custom-port"] will be created
  + resource "aws_security_group_rule" "ecs_ingress_demo" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow traffic to custom port"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3001
      + type                     = "ingress"
    }

  # module.network.aws_security_group_rule.ecs_ingress_demo["ssh"] will be created
  + resource "aws_security_group_rule" "ecs_ingress_demo" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH access"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.network.aws_subnet.private-subnets[0] will be created
  + resource "aws_subnet" "private-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-ec-fargate-vpc-Private-Subnet-1"
          + "environment" = "dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-Private-Subnet-1"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private-subnets[1] will be created
  + resource "aws_subnet" "private-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-ec-fargate-vpc-Private-Subnet-2"
          + "environment" = "dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-Private-Subnet-2"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public-subnets[0] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-ec-fargate-vpc-Public-Subnet-1"
          + "environment" = "dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-Public-Subnet-1"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public-subnets[1] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo-ec-fargate-vpc-Public-Subnet-2"
          + "environment" = "dev"
        }
      + tags_all                                       = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-Public-Subnet-2"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.demo-vpc will be created
  + resource "aws_vpc" "demo-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "demo-ec-fargate-vpc-dev"
          + "Owner"       = "demo-ecs-fargate"
          + "environment" = "dev"
        }
      + tags_all                             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-ec-fargate-vpc-dev"
          + "Owner"       = "demo-ecs-fargate"
          + "Project"     = "ecs-fargate"
          + "environment" = "dev"
        }
    }

  # module.patitent.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "demo-ecs-patitent"
    }

  # module.patitent.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo-ecs-patitent"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment" = "default"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ecs-fargate"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 45 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name               = (known after apply)
  + alb_id                     = (known after apply)
  + appointment_repository_arn = (known after apply)
  + appointment_repository_url = (known after apply)
  + appointment_service_id     = (known after apply)
  + appointment_service_ip     = true
  + appointment_tg_arn         = (known after apply)
  + ecs_cluster_id             = (known after apply)
  + ecs_cluster_name           = "demo-ecs-cluster"
  + ecs_execution_role_arn     = (known after apply)
  + ecs_task_definition_arn    = (known after apply)
  + ecs_task_role_arn          = (known after apply)
  + log_group_name             = "ecs-cluster-logs"
  + natgw_eip                  = (known after apply)
  + natgw_id                   = (known after apply)
  + patient_service_id         = (known after apply)
  + patient_service_ip         = true
  + patient_tg_arn             = (known after apply)
  + patitent_repository_arn    = (known after apply)
  + patitent_repository_url    = (known after apply)
  + private_subnet_ids         = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids          = [
      + (known after apply),
      + (known after apply),
    ]
  + route_table_id             = [
      + (known after apply),
    ]
  + vpc_id                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @devops979, Action: `pull_request`*